In [6]:
import numpy as np

In [7]:
my_numpy_array = np.random.rand(3)

In [8]:
type(my_numpy_array)

numpy.ndarray

In [9]:
my_numpy_array[0]

0.2696564060479606

In [10]:
import pandas as pd

In [11]:
my_series = pd.Series(my_numpy_array, index=["First", "Second", "Third"])
my_series

First     0.269656
Second    0.889197
Third     0.773091
dtype: float64

In [12]:
my_series[0]

0.2696564060479606

In [13]:
my_series.index

Index(['First', 'Second', 'Third'], dtype='object')

In [14]:
array_2d = np.random.rand(3,2)

In [15]:
array_2d[0,1]

0.18445471632195054

In [16]:
df = pd.DataFrame(array_2d)

In [17]:
df

          0         1
0  0.463745  0.184455
1  0.326698  0.478267
2  0.524919  0.618725

In [18]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [19]:
df.columns = ["First", "Second"]

In [20]:
df

      First    Second
0  0.463745  0.184455
1  0.326698  0.478267
2  0.524919  0.618725

In [21]:
df["Second"]

0    0.184455
1    0.478267
2    0.618725
Name: Second, dtype: float64

In [22]:
# read the first 5 rows
#df = pd.read_csv('artwork_data.csv')

# All columns we are using
COLS_TO_USE = ['id', 'artist',
                  'title', 'medium', 'year', 'acquisitionYear', 'height',
                  'width', 'units']

In [23]:
df=pd.read_csv('artwork_data.csv',index_col='id',
                usecols=COLS_TO_USE)
df

C:\Users\wuamy\AppData\Local\Temp\ipykernel_22280\260144216.py:1: DtypeWarning: Columns (9,13) have mixed types. Specify dtype option on import or set low_memory=False.
  df=pd.read_csv('artwork_data.csv',index_col='id',

,artist,title,medium,year,acquisitionYear,width,height,units
id,,,,,,,,
1035,"Blake, Robert",A Figure Bowing before a Seated Old Man with h...,"Watercolour, ink, chalk and graphite on paper....",NaN,1922.0,394,419.0,mm
1036,"Blake, Robert","Two Drawings of Frightened Figures, Probably f...",Graphite on paper,NaN,1922.0,311,213.0,mm
1037,"Blake, Robert",The Preaching of Warning. Verso: An Old Man En...,Graphite on paper. Verso: graphite on paper,1785.0,1922.0,343,467.0,mm
1038,"Blake, Robert",Six Drawings of Figures with Outstretched Arms,Graphite on paper,NaN,1922.0,318,394.0,mm
1039,"Blake, William",The Circle of the Lustful: Francesca da Rimini...,Line engraving on paper,1826.0,1919.0,243,335.0,mm
...,...,...,...,...,...,...,...,...
122960,"P-Orridge, Genesis",Larvae (from Tampax Romana),"Perspex, Wood, hairpiece, tampon and human blood",1975,2013.0,305,305.0,mm
122961,"P-Orridge, Genesis",Living Womb (from Tampax Romana),"Wood, Perspex, plastic, photograph on paper, t...",1976,2013.0,305,305.0,mm
121181,"Hatoum, Mona",Present Tense,Soap and glass beads,1996,2013.0,45,2410.0,mm
112306,"Creed, Martin",Work No. 227: The lights going on and off,Gallery lighting,2000,2013.0,NaN,NaN,NaN
127035,"Brunias, Agostino",Dancing Scene in the West Indies,Oil paint on canvas,1764,2013.0,508,660.0,mm

In [24]:
import json

In [25]:
#example usage of from_records method
records = [("Espresso", '5$'),
          ("Flat White", "10$")]
pd.DataFrame.from_records(records)
pd.DataFrame.from_records(records,
                         columns=["Coffee", "Price"])

       Coffee Price
0    Espresso    5$
1  Flat White   10$

In [26]:
# import json 
KEYS_TO_USE = ['id', 'all_artists',
                  'title', 'medium', 'dateText', 'acquisitionYear', 'height',
                  'width', 'units']
def get_record_from_file(file_path, KEYS_TO_USE):
    with open(file_path) as artwork_file:
        content = json.load(artwork_file)
    
    record = []
    for field in KEYS_TO_USE:
        record.append(content[field])
    return tuple(record)

# single file processing
sample_record = get_record_from_file('a00001-1035.json', KEYS_TO_USE)

In [27]:
sample_record

(1035,
 'Robert Blake',
 'A Figure Bowing before a Seated Old Man with his Arm Outstretched in Benediction. Verso: Indecipherable Sketch',
 'Watercolour, ink, chalk and graphite on paper. Verso: graphite on paper',
 'date not known',
 1922,
 '419',
 '394',
 'mm')

In [28]:
# Demo1
df.artist
artists = df['artist']
pd.unique(artists)
len(pd.unique(artists))

3336

In [29]:
# demo 2
s = df['artist']=='Bacon, Francis'
s.value_counts()

False    69151
True        50
Name: artist, dtype: int64

In [30]:
# other way
artist_counts = df['artist'].value_counts()
artist_counts['Bacon, Francis']

50

In [31]:
# demo 3
df.loc[1035, 'artist']
#df.iloc[0, 0]
#df.iloc[0, :]
df.iloc[0:2, 0:2]

             artist                                              title
id
1035  Blake, Robert  A Figure Bowing before a Seated Old Man with h...
1036  Blake, Robert  Two Drawings of Frightened Figures, Probably f...

In [34]:
# try multipliation
#df['height'] * df['width']
df.shape

(69201, 8)

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69201 entries, 1035 to 127035
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   artist           69201 non-null  object
 1   title            69201 non-null  object
 2   medium           62817 non-null  object
 3   year             63823 non-null  object
 4   acquisitionYear  69156 non-null  float64
 5   width            65860 non-null  object
 6   height           65860 non-null  object
 7   units            65860 non-null  object
dtypes: float64(1), object(7)
memory usage: 6.8+ MB

In [44]:
#df['width'].astype(float) * df['height'].astype(float)
df['width'].sort_values().head()
df['width'].sort_values().tail()
type(df['width'])

pandas.core.series.Series

In [47]:
# try to convert
#pd.to_numeric(df['width'])
# force nans
#pd.to_numeric(df['width'], errors='coerce')
df.loc[:,'width'] = pd.to_numeric(df['width'], errors='coerce')

C:\Users\wuamy\AppData\Local\Temp\ipykernel_22280\3446483944.py:5: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:,'width'] = pd.to_numeric(df['width'], errors='coerce')

In [48]:
type(df['width'])

pandas.core.series.Series

In [50]:
df.loc[:,'height'] = pd.to_numeric(df['height'], errors='coerce')

C:\Users\wuamy\AppData\Local\Temp\ipykernel_22280\2826523437.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  df.loc[:,'height'] = pd.to_numeric(df['height'], errors='coerce')

In [51]:
df['height'].dtype

dtype('float64')

In [52]:
df['height'] * df['width']

id
1035      165086.0
1036       66243.0
1037      160181.0
1038      125292.0
1039       81405.0
            ...
122960     93025.0
122961     93025.0
121181    108450.0
112306         NaN
127035    335280.0
Length: 69201, dtype: float64

In [53]:
df['units'].value_counts()

mm    65860
Name: units, dtype: int64

In [54]:
# assign - create new columns with size
area = df['height']*df['width']
df = df.assign(area=area)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69201 entries, 1035 to 127035
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   artist           69201 non-null  object
 1   title            69201 non-null  object
 2   medium           62817 non-null  object
 3   year             63823 non-null  object
 4   acquisitionYear  69156 non-null  float64
 5   width            65834 non-null  float64
 6   height           65859 non-null  float64
 7   units            65860 non-null  object
 8   area             65833 non-null  float64
dtypes: float64(4), object(5)
memory usage: 7.3+ MB

In [57]:
df['area'].max()

132462000.0

In [58]:
df['area'].idxmax()

98367

In [59]:
df.loc[df['area'].idxmax(),:]

artist                               Therrien, Robert
title                No Title (Table and Four Chairs)
medium             Aluminium, steel, wood and plastic
year                                           2003.0
acquisitionYear                                2008.0
width                                          8920.0
height                                        14850.0
units                                              mm
area                                      132462000.0
Name: 98367, dtype: object

In [61]:
# iteration
small_df = df.iloc[49980:50019, :].copy()
grouped = small_df.groupby('artist')
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [64]:
for name, group_df in grouped:
    #print(name)
    print(group_df)
    break

                artist            title               medium    year  \
id
4704  Frost, Sir Terry        Blue Moon  Lithograph on paper  1952.0
4705  Frost, Sir Terry      Boat Shapes     Linocut on paper  1952.0
4706  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954.0
4707  Frost, Sir Terry      Boat Shapes     Linocut on paper  1954.0
4708  Frost, Sir Terry            Leeds    Drypoint on paper  1956.0
4709  Frost, Sir Terry  Camping, Anduze     Etching on paper  1979.0
4710  Frost, Sir Terry     Umea, Sweden     Etching on paper  1979.0
4711  Frost, Sir Terry    Self-Portrait     Etching on paper  1980.0

      acquisitionYear  width  height units     area
id
4704           1983.0  355.0   273.0    mm  96915.0
4705           1983.0  132.0   143.0    mm  18876.0
4706           1983.0  131.0   155.0    mm  20305.0
4707           1983.0  193.0   267.0    mm  51531.0
4708           1983.0  125.0   167.0    mm  20875.0
4709           1983.0  257.0   209.0    mm  53713.0
4710           1983.0    NaN     NaN   NaN      NaN
4711           1983.0  277.0   200.0    mm  55400.0

In [65]:
# aggregate 
# min
for name, group_df in small_df.groupby('artist'):
    min_year = group_df['acquisitionYear'].min()
    print("{}: {}".format(name, min_year))

Frost, Sir Terry: 1983.0
Phillips, Esq Tom: 1983.0
Wols: 1983.0

In [ ]:
# Transform
# Equivalent of editing by hand: